// ДЗ:
// - Завдання 1. Написати скріпт, в якому користувач вводить свій вік (prompt), якщо його вік від 18 до 45 включно, то вивести повідомлення що він підходить, якщо ні,то не підходить.

let userAge = prompt("Завдання 1. Який ваш вік?", 0);

// if (userAge < 18) {
//   if (userAge > 45);
//   alert("Ви не підходите");
// } else alert("Ви підходите");

// або

userAge < 18 || userAge > 45 ? alert("Ви не підходите") : alert("Ви підходите");

// - Завдання 2. Якщо змінна a більша 3-х і менше 12 і змінна b більше або дорівнює 5 і менше  13, то вивести “вірно”, в іншому випадку “не вірно”.

let a = prompt("Завдання 2. Введить першу змінну", 0);
let b = prompt("Введить другу змінну", 0);

// if (a > 3 && a < 12 && b >= 5 && b < 13) {
//   alert("вірно");
// } else {
//   alert("не вірно");
// }

// або

a > 3 && a < 12 && b >= 5 && b < 13 ? alert("вірно") : alert("не вірно");

//Задача 2. Написати скріпт, який приймає від користувача його ім”я, суму депозиту, і строк дії депозиту (місяці), і виводить інфу скільки людина заробить  за цей проміжок часу. Депозитна ставка - 20% річних. Повертає повідомлення:” Шановний …., Ви внесли …. грн., під 20% річних, на термін … місяців. За цей період часу Ви заробите … грн.
// - Завдання 3. Доповнення до завдання про депозити з попереднього заняття, тільки в залежності від місяців будуть інші депозитні ставки:
// <6 - 15%
// Від 6 до 9 - 16%
// >9 - 17 %
let userName, depositAmount, depositTerm;

userName = prompt("Завдання 3. Введіть Ваше ім”я", "");
depositAmount = prompt("Яку суму у грн. ви бажаєте покласти? ", 0);
depositTerm = prompt(
  "В залежності від місяців депозиту діють таки депозитні ставки: <6 - 15%, Від 6 до 9 - 16%, >9 - 17% річних. На який час (у місяцах) бажаєте зробити вклад?",
  0
);

depositTerm < 6
  ? (depositRate = 1.15) && (v = 15)
  : depositTerm > 9
  ? (depositRate = 1.17) && (v = 17)
  : (depositRate = 1.16) && (v = 16);

alert(
  "Шановний(a) " +
    userName +
    ", Ви бажаєте внести " +
    depositAmount +
    "грн. під " +
    v +
    "% річних на термін " +
    depositTerm +
    " місяців. За цей проміжок часу Ви заробите " +
    (sum = ((depositAmount * depositRate) / 12) * depositTerm) +
    "грн." +
    " та сума, яку ви отримаєте, складає " +
    (+depositAmount + +sum) +
    "грн."
);
